export const user = {
  id: 0,
  fullName: 'Бацик Володимир Васильович',
  numberOfTicket: 49894829,
}

export const violation_article = [
	{
		id: 0,
		title: 'ст.1 ч. 122',
		price: 340
	},
	{
		id: 1,
		title: 'ст.3 ч. 122',
		price: 680
	}
]

export const violation_name = [
	{
		id: 12,
		title: 'Знак 3.34 «Зупинку заборонено»',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 3.34 «зупинку заборонено», чим порушив пункт 8.4 "в" і 33.3.34 ПДР України.'
	},
	{
		id: 13,
		title: 'Смуга для руху маршрутних т.з.',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 5.11 "Смуга для руху маршрутних транспортних засобів", чим порушив пункт 17.1 і 33.5.11 ПДР України.'
	},
	{
		id: 14,
		title: 'Два і більше ряди',
		description:
			'водій даного т/з здійснив зупинку на проїзній частині в два і більше ряди, чим порушив п.15.4 ПДР України.'
	},
	{
		id: 9,
		title: 'Пішохідний перехід (зупинка)',
		description:
			'водій даного т/з здійснив зупинку на пішохідному переході, що створює перешкоду руху пішоходам, чим порушив п.15.9 "г" ПДР України.'
	},
	{
		id: 10,
		title: 'Перехрестя (зупинка)',
		description:
			'водій даного т/з здійснив зупинку на перехресті, що створює перешкоду дорожньому руху, чим порушив п. 15.9 «ґ» ПДР України.'
	},
	{
		id: 0,
		title: 'Не на краю тротуара',
		description:
			'водій даного т/з здійснив стоянку на тротуарі (не на краю тротуара), чим порушив п. 15.10 «в» ПДР України.'
	},
	{
		id: 1,
		title: 'Тротуар 2 м. віддалемір',
		description:
			'водій даного т/з здійснив стоянку на тротуарі, що створює перешкоду для руху пішоходів, залишивши для їхнього руху менше 2 метрів, порушивши п. 15.10 «в» ПДР. Виміри здійснено віддалеміром ________ номер _______. ( _ см.)'
	},
	{
		id: 2,
		title: 'Тротуар без варіантів ',
		description:
			'водій даного т/з здійснив стоянку на тротуарі, що створює перешкоду для руху пішоходів, чим порушив п. 15.10 "б","в","д" ПДР України.'
	},
	{
		id: 3,
		title: 'Тротуар до 2 метра (з рулеткою)',
		description:
			'водій даного т/з здійснив зупинку (стоянку) на тротуарі, що створює перешкоди у русі пішоходів, ширина смуги для руху пішоходів є меншою за 2 метри, чим порушив п. 15.10 «б», «в» ПДР України. Виміри ( _____ см.) здійснено рулеткою ____'
	},
	{
		id: 4,
		title:
			'Розділювальна смуга вул. Франка/пл.Соборна, 9. Понад 5 хв.',
		description:
			'здійснив стоянку на розділювальній смузі, порушивши п. 15.1 ПДР '
	},
	{
		id: 5,
		title: 'Зупинка автобуса - ближче ніж за 30 метрів (з рулеткою',
		description:
			'водій даного т/з здійснив зупинку ближче ніж за 30 метрів від дорожнього знаку 5.41.2 «Кінець пукту зупинки автобуса», чим порушив п. 15.9 «е» ПДР України. Виміри ( ____см.) здійснено рулеткою/відділеміром '
	},
	{
		id: 6,
		title: 'Запинка автобуса',
		description:
			'водій даного ТЗ здійснив зупинку в межах посадкового майданчика маршрутних транспортних засобів, а саме в зоні дії знаків 5.45.1 "Пункт зупинки автобуса" та 5.41.2 "Кінець пункту зупинки автобуса" чим порушив п. 15.9 "е" ПДР України.'
	},
	{
		id: 7,
		title: 'Галицький базар (зупинка)',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 3.34 «Зупинку заборонено», що створює перешкодy дорожньому руху, чим порушив: п. 8.4 «в»;'
	},
	{
		id: 8,
		title: 'Пішохідний переход (10 метрів з рулеткою) (зупинка)',
		description:
			'водій даного т/з здійснив зупинку на відстані ближче ніж за 10 метрів від пішохідного перехода, чим порушив п. 15.9 «г» ПДР України. Виміри ( _____ см.) здійснено рулеткою ___'
	},

	{
		id: 11,
		title: 'Односторонній рух (Гавришкевича, Коперника 21-1 ',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 3.34 «Зупинку заборонено», що створює перешкоду дорожньому руху, чим порушив: п. п. 8.4 «в»; 33.3.34; 15.3 ПДР України'
	},

	{
		id: 15,
		title: 'Прилегла територія (виїзд з неї) (зупинка)',
		description:
			'водій даного т/з здійснив зупинку в місці виїзду з прилеглої території і створює перешкоду для руху інших т/з, чим порушив п. 15.9«и» ПДР України.'
	},
	{
		id: 16,
		title: 'Газон. Стоянка – понад 5 хв.!!!',
		description:
			'водій даного т/з здійснив стоянку на газоні, чим порушив п.15.10 "є" ПДР України. '
	},
	{
		id: 17,
		title: 'Смуга Дорошенка (зупинка)',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 5.11 "Смуга для руху маршрутних транспортних засобів", чим порушив пункт 17.1 і 33.5.8 ПДР України.'
	},
	{
		id: 18,
		title: 'Крива Липа (проїзд) Стоянка – понад 5 хв.!!!',
		description:
			'водій даного т/з здійснив стоянку в зоні дії дор. знаку 3.38 "Зона обмеженої стоянки", чим порушив п.8.4 "в", 33.3.38 ПДР України.'
	},
	{
		id: 19,
		title:
			'Три метра (відстань між суцільною лінією розмітки і т.з.)',
		description:
			'водій даного т. з. здійснив зупинку на проїзній частині, де відстань між суцільною лінією розмітки і транспортним засобом менше трьох метрів, а саме: (вказати відстань), чим порушив пункт 15.9 «д» ПДР України. '
	},
	{
		id: 20,
		title: "Неможливим зустрічний роз'їзд або об'їзд т/з",
		description:
			'водій даного т/з здійснив зупинку у місцях, де буде неможливим зустрічний роз\'їзд або об\'їзд транспортного засобу, що зупинився, чим порушив п.15.9 "ж" ПДР України.'
	},
	{
		id: 21,
		title: 'Закриває світлофор або дорожні знаки',
		description:
			'водій даного т/з здійснив зупинку у місцях, де транспортний засіб закриває від інших водіїв сигнали світлофора або дорожні знаки, чим порушив п.15.9 "з" ПДР України. '
	},
	{
		id: 22,
		title: 'Смітник',
		description:
			'на даному транспортному засобі було здійснено зупинку в межах контейнерного майданчику, а саме в місці знаходження контейнерів для збирання побутових відходів, чим порушив ,п 15.10 "е", 15.9 "ж" ПРД України.'
	}
]

export const violationHtml = (
	date,
	noticeNumber,
	userName,
	carMark,
	carModel,
	carNumber,
	violationAddress,
	violationName,
	violationAdministrative,
	violationPrice,
	technicalDevice
) => {
	const html = `
	<!DOCTYPE html>
	<html lang="ua-UA">
	<head>
		<meta charset="UTF-8">
		<meta http-equiv="X-UA-Compatible" content="IE=edge">
		<meta name="viewport" content="width=device-width, initial-scale=1.0">
		<title>Document</title>
	</head>
	<style>
    h1 {
        font-size: 34px;
        text-align: center;
    }
    p {
        font-size: 30px;
        margin: 10px;
        padding: 0px;
		padding-right: 20px;
		margin-right: 20px;
		margin-bottom: 0
    }
	</style>
	
	<body  style="text-align: justify;">
	<h1>ПОВІДОМЛЕННЯ ПРО ПРИТЯГНЕННЯ ДО АДМІНІСТРАТИВНОЇ ВІДПОВІДАЛЬНОСТІ</h1>
	<p style="text-align: center;">до постанови серії ЛВ № <b>${noticeNumber}</b></p>
	<p style="text-align: center;">м.Львів</p>
	<p style="text-align: right;">${date}</p>
	<p style="text-align: right;">тел.: 0634866393</p>

	<p>
		Повідомляємо, що інспектором з паркування, управління безпеки департаменту міської мобільності та вуличної інфраструктури 
		Львівської міської ради, ${userName} в режимі фото/відеозйомки зафіксовано порушення правил зупинки, 
		стоянки, паркування транспортного засобу (ПДР України) <b>${carMark} ${carModel}, ${carNumber}, ${date}, м. Львів, 
		 ${violationAddress}</b>, ${violationName}, відповідальність за яке передбачена ${violationAdministrative} Правил дорожнього руху.
	</p>
	<br />
	<p>
		У відношенні власника (належного користувача) транспортного засобу буде винесено постанову про накладення адміністративного стягнення
		у вигляді штрафу в розмірі <b>${violationPrice} гривень</b>, без евакуації/з евакуацією.
	</p>
	<br />
	<p>
		Фото/відеоматеріали транспортного засобу в момент вчинення правопорушення, розміщено на офіційному 
		Веб-сайті: www.inspector.lviv.ua. Ідентифікатором для доступу до зображень транспортного засобу є державний 
		номерний знак транспортного засобу - ${carNumber}.
	</p>
	<br />
	<p>
		Технічний засіб, яким здійснено фото/відеофіксацію: ${technicalDevice}.
	</p>
	<br />
	<p>
		Постанова про накладення адміністративного стягнення, що не була виконана шляхом сплати 50 відсотків 
		розміру штрафу протягом десяти днів з дня її винесення, надсилається відповідальній особі, зазначеній 
		у частині першій статті 14-2 цього Кодексу, рекомендованим листом з повідомленням на адресу місця 
		реєстрації (проживання) фізичної особи (місцезнаходження юридичної особи). За зверненням особи 
		постанова про накладення адміністративного стягнення, що вважається виконаною, надсилається 
		рекомендованим листом на її адресу протягом п’яти днів з моменту отримання звернення.
	</p>
	<br />

	<p>Реквізити на оплату штрафу:</p>
	<p>Отримувач: ГУК Львiв/Львівська тг/21081100</p>
	<p>Код отримувача: 38008294</p>
	<p>Банк отримувача: Казначейство України (ЕАП)</p>
	<p>Рахунок №</p>
	<p>UA638999980314060542000013933</p>
	<p>Найменування коду класифікації доходів бюджету: адміністративні штрафи та інші санкції</p>
	<br />
	<p>
		На підставі ч.1-2 ст.300-1 КУпАП у разі сплати відповідальною особою, зазначеною у частині 
		першій статті 14-2 цього Кодексу, або громадянином (резидентом) України, який ввіз на територію 
		України транспортний засіб, зареєстрований за межами України, 50 відсотків розміру штрафу за постановою 
		про накладення адміністративного стягнення за правопорушення у сфері забезпечення безпеки дорожнього руху, 
		зафіксоване в автоматичному режимі, або за порушення правил зупинки, стоянки, паркування транспортних засобів, 
		зафіксоване в режимі фотозйомки (відеозапису), до вручення такої постанови або отримання поштового повідомлення 
		про вручення або про відмову в її отриманні, або повернення поштового відправлення з позначкою про невручення, 
		або протягом десяти днів з дня набрання постановою законної сили така постанова вважається виконаною. Постанова про накладення 
		адміністративного стягнення за порушення зупинки, стоянки та паркування транспортних засобів, зафіксоване в режимі 
		фотозйомки (відеозапису), також вважається виконаною у разі сплати штрафу за повідомленням про притягнення до адміністративної 
		відповідальності, залишеним уповноваженою посадовою особою на місці вчинення правопорушення на лобовому склі транспортного засобу, 
		у тому числі шляхом сплати 50 відсотків розміру штрафу протягом десяти днів з дня вчинення відповідного правопорушення.
	</p>
	<br />
	<p>
		У разі несплати штрафу особами, зазначеними у частинах першій та другій 
		статті 14-2 цього Кодексу, протягом 30 днів з дня набрання законної сили постановою 
		про накладення адміністративного стягнення за правопорушення у сферах безпеки дорожнього руху 
		та паркування транспортних засобів така постанова підлягає примусовому виконанню.
	</p>
	<br />
	<p>
		Відповідно до ст.291 КУпАП постанова набирає законної сили після її вручення особі або 
		отримання поштового повідомлення про вручення або про відмову в її отриманні, або повернення поштового 
		відправлення з позначкою про невручення, або під час її виконання у випадках, передбачених частиною першою статті 300-1 цього Кодексу.
	</p>
	<br />
	<p>
		Відповідальна особа, зазначена у ч.1 ст.14-2 КУпАП, або особа, яка ввезла транспортний засіб на територію України, 
		звільняється від адміністративної відповідальності за порушення правил зупинки, стоянки, паркування транспортних засобів, 
		зафіксовані в режимі фотозйомки (відеозапису), у випадках, передбачених ст.279-3 КУпАП.
	</p>
	<br />
	<p>
		Відповідно до ч.2 ст.308 КУпАП у порядку примусового виконання постанови про стягнення штрафу за вчинення 
		адміністративного правопорушення з правопорушника стягується подвійний розмір штрафу, визначеного у відповідній статті КУпАП 
		та зазначеного у постанові про накладення штрафу.
	</p>
	<br />
	<p>
		Постанову інспектора з паркування про накладення адміністративного стягнення може бути 
		оскаржено в районний, районний у місті, міський чи міськрайонний суд.
	</p>
	<br />
	<p>____________________________</p>
	<p>(підпис особи, яка винесла повідомлення)</p>
	<br />
	<p>_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _</p>	

	<p>Квитанція про сплату штрафу до постанови</p>
	<p>серія ЛВ № ${noticeNumber}</p>
	<p>Ця частина залишається у банківській установі</p>
	<p>1.______________________</p>
	<p><small>(прізвище, ім’я по батькові платника)</small></p>
	<p>2.______________________</p>
	<p><small>(власник транспортного засобу)</small></p>
	<p>3.______________________</p>
	<p><small>(ІПН, ЕДРПОУ власника транспортного засобу)</small></p>
	<p>4. ${carNumber}</p>
	<p><small>(держ. номерний знак транспортного засобу)</small></p>
	<p>5. ${violationPrice} грн.</p>
	<p><small>(сума штрафу)</small></p>
	<p>6.${violationAdministrative}</p>
	<p>7. Адміністративний штраф</p>
	<p>серія ЛВ № ${noticeNumber}</p>
	<p><small>(призначення платежу)</small></p> 
	<p>8. ГУК Львiв/Львівська тг/21081100</p>
	<p><small>(банк отримувача)</small></p>
	<p>9. 38008294</p>
	<p><small>(код банка отримувача згідно з ЄДРПОУ)</small></p>
	<p>10. UA638999980314060542000013933</p>
	<p><small>(розрахунковий рахунок)</small></p>
	<p>11. Касир _______________</p>
	<p>                 <small>(підпис)</small></p>
	<p>12. Платник______________</p>
	<p>                 <small>(підпис)</small></p>
	<br />
	<p>М. П.</p>
	<br />
	<p></p>Дата здійснення операції\&
	<br />
	<p>«___»__________ 2022 року</p>
	<br />
	<p>Квитанція про сплату штрафу заповнюється банківською установою або платником штрафу</p>
	<p>www.inspector.lviv.ua</p>
	</body>
	</html>
	`
	return html
}