export const user = {
  id: 0,
  fullName: 'Бацик Володимир Васильович',
  numberOfTicket: 49894829,
}

export const violation_article = [
	{
		id: 0,
		title: 'ст.1 ч. 122',
		price: 340
	},
	{
		id: 1,
		title: 'ст.3 ч. 122',
		price: 680
	}
]

export const violation_name = [
	{
		id: 12,
		title: 'Знак 3.34 «Зупинку заборонено»',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 3.34 «зупинку заборонено», чим порушив пункт 8.4 "в" і 33.3.34 ПДР України.'
	},
	{
		id: 13,
		title: 'Смуга для руху маршрутних т.з.',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 5.11 "Смуга для руху маршрутних транспортних засобів", чим порушив пункт 17.1 і 33.5.11 ПДР України.'
	},
	{
		id: 14,
		title: 'Два і більше ряди',
		description:
			'водій даного т/з здійснив зупинку на проїзній частині в два і більше ряди, чим порушив п.15.4 ПДР України.'
	},
	{
		id: 9,
		title: 'Пішохідний перехід (зупинка)',
		description:
			'водій даного т/з здійснив зупинку на пішохідному переході, що створює перешкоду руху пішоходам, чим порушив п.15.9 "г" ПДР України.'
	},
	{
		id: 10,
		title: 'Перехрестя (зупинка)',
		description:
			'водій даного т/з здійснив зупинку на перехресті, що створює перешкоду дорожньому руху, чим порушив п. 15.9 «ґ» ПДР України.'
	},
	{
		id: 0,
		title: 'Не на краю тротуара',
		description:
			'водій даного т/з здійснив стоянку на тротуарі (не на краю тротуара), чим порушив п. 15.10 «в» ПДР України.'
	},
	{
		id: 1,
		title: 'Тротуар 2 м. віддалемір',
		description:
			'водій даного т/з здійснив стоянку на тротуарі, що створює перешкоду для руху пішоходів, залишивши для їхнього руху менше 2 метрів, порушивши п. 15.10 «в» ПДР. Виміри здійснено віддалеміром ________ номер _______. ( _ см.)'
	},
	{
		id: 2,
		title: 'Тротуар без варіантів ',
		description:
			'водій даного т/з здійснив стоянку на тротуарі, що створює перешкоду для руху пішоходів, чим порушив п. 15.10 "б","в","д" ПДР України.'
	},
	{
		id: 3,
		title: 'Тротуар до 2 метра (з рулеткою)',
		description:
			'водій даного т/з здійснив зупинку (стоянку) на тротуарі, що створює перешкоди у русі пішоходів, ширина смуги для руху пішоходів є меншою за 2 метри, чим порушив п. 15.10 «б», «в» ПДР України. Виміри ( _____ см.) здійснено рулеткою ____'
	},
	{
		id: 4,
		title:
			'Розділювальна смуга вул. Франка/пл.Соборна, 9. Понад 5 хв.',
		description:
			'здійснив стоянку на розділювальній смузі, порушивши п. 15.1 ПДР '
	},
	{
		id: 5,
		title: 'Зупинка автобуса - ближче ніж за 30 метрів (з рулеткою',
		description:
			'водій даного т/з здійснив зупинку ближче ніж за 30 метрів від дорожнього знаку 5.41.2 «Кінець пукту зупинки автобуса», чим порушив п. 15.9 «е» ПДР України. Виміри ( ____см.) здійснено рулеткою/відділеміром '
	},
	{
		id: 6,
		title: 'Запинка автобуса',
		description:
			'водій даного ТЗ здійснив зупинку в межах посадкового майданчика маршрутних транспортних засобів, а саме в зоні дії знаків 5.45.1 "Пункт зупинки автобуса" та 5.41.2 "Кінець пункту зупинки автобуса" чим порушив п. 15.9 "е" ПДР України.'
	},
	{
		id: 7,
		title: 'Галицький базар (зупинка)',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 3.34 «Зупинку заборонено», що створює перешкодy дорожньому руху, чим порушив: п. 8.4 «в»;'
	},
	{
		id: 8,
		title: 'Пішохідний переход (10 метрів з рулеткою) (зупинка)',
		description:
			'водій даного т/з здійснив зупинку на відстані ближче ніж за 10 метрів від пішохідного перехода, чим порушив п. 15.9 «г» ПДР України. Виміри ( _____ см.) здійснено рулеткою ___'
	},

	{
		id: 11,
		title: 'Односторонній рух (Гавришкевича, Коперника 21-1 ',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 3.34 «Зупинку заборонено», що створює перешкоду дорожньому руху, чим порушив: п. п. 8.4 «в»; 33.3.34; 15.3 ПДР України'
	},

	{
		id: 15,
		title: 'Прилегла територія (виїзд з неї) (зупинка)',
		description:
			'водій даного т/з здійснив зупинку в місці виїзду з прилеглої території і створює перешкоду для руху інших т/з, чим порушив п. 15.9«и» ПДР України.'
	},
	{
		id: 16,
		title: 'Газон. Стоянка – понад 5 хв.!!!',
		description:
			'водій даного т/з здійснив стоянку на газоні, чим порушив п.15.10 "є" ПДР України. '
	},
	{
		id: 17,
		title: 'Смуга Дорошенка (зупинка)',
		description:
			'водій даного т/з здійснив зупинку в зоні дії дорожнього знаку 5.11 "Смуга для руху маршрутних транспортних засобів", чим порушив пункт 17.1 і 33.5.8 ПДР України.'
	},
	{
		id: 18,
		title: 'Крива Липа (проїзд) Стоянка – понад 5 хв.!!!',
		description:
			'водій даного т/з здійснив стоянку в зоні дії дор. знаку 3.38 "Зона обмеженої стоянки", чим порушив п.8.4 "в", 33.3.38 ПДР України.'
	},
	{
		id: 19,
		title:
			'Три метра (відстань між суцільною лінією розмітки і т.з.)',
		description:
			'водій даного т. з. здійснив зупинку на проїзній частині, де відстань між суцільною лінією розмітки і транспортним засобом менше трьох метрів, а саме: (вказати відстань), чим порушив пункт 15.9 «д» ПДР України. '
	},
	{
		id: 20,
		title: "Неможливим зустрічний роз'їзд або об'їзд т/з",
		description:
			'водій даного т/з здійснив зупинку у місцях, де буде неможливим зустрічний роз\'їзд або об\'їзд транспортного засобу, що зупинився, чим порушив п.15.9 "ж" ПДР України.'
	},
	{
		id: 21,
		title: 'Закриває світлофор або дорожні знаки',
		description:
			'водій даного т/з здійснив зупинку у місцях, де транспортний засіб закриває від інших водіїв сигнали світлофора або дорожні знаки, чим порушив п.15.9 "з" ПДР України. '
	},
	{
		id: 22,
		title: 'Смітник',
		description:
			'на даному транспортному засобі було здійснено зупинку в межах контейнерного майданчику, а саме в місці знаходження контейнерів для збирання побутових відходів, чим порушив ,п 15.10 "е", 15.9 "ж" ПРД України.'
	}
]